FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
/*
 * ESP32 PhotoFrame Fetcher - POWER-OPTIMIZED VERSION
 * 
 * SPDX-License-Identifier: Apache-2.0
 * Copyright (c) 2025 Florian Braun (FloThinksPi)
 * 
 * Power Optimizations:
 * - CPU: 120MHz single-core for power efficiency
 * - WiFi: Low power mode (2dBm TX, MAX_MODEM sleep) for battery conservation
 * - Memory: ESP32-specific heap allocation and DMA-capable buffers
 * - Transfer: Zero-copy burst transfers with pre-compiled command buffers
 * - Target: Balance performance with power consumption for battery operation
 */

#include <Arduino.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <ESPmDNS.h>
#include <Wire.h>
#include <ImageData.h>
#include <esp_sleep.h> // For deep sleep power management
#include <WebServer.h> // For web UI
#include <Preferences.h> // For persistent URL storage
#include <Update.h> // For OTA firmware updates

// ESP32 WiFi Power Management Includes
#include <WiFi.h>
#include <esp_wifi.h>

// ESP32 Model Detection Includes
#include <esp_chip_info.h>
#include <esp_system.h>

// ESP32 Performance Optimization Includes
#ifdef ESP32_PERFORMANCE_OPTIMIZED
extern "C" {
  #include "esp_timer.h"
  #include "esp_system.h"
  #include "esp_heap_caps.h"
}
#endif

// Forward declarations
void autoFetchOnBoot();
bool downloadAndStreamImage(const char* url);
bool downloadAndConvertBmpImage(const char* url);
bool sendImageChunkToAddress(uint32_t address_offset, const uint8_t* data, size_t data_size);
bool sendImageChunkBurst(uint32_t start_address, const uint8_t* data, size_t total_size);
bool sendBatteryInfoToDisplay(float voltage, uint32_t cycles);
bool getDebugMode();
bool setDebugMode(bool enable);
int calculateBatteryPercentage(float voltage);
void saveUrls();
void saveAdminSettings();
void initUrlStorage();
void initBatteryData();
void saveBatteryData();
String getCurrentUrlAndAdvance();
bool addUrl(const String& url);
bool removeUrl(int index);

// ESP32 WiFi Power Management Functions for Download Optimization
void setWiFiLowPowerMode();
void setWiFiPerformanceMode();
void setWiFiShutdownMode();

// ESP32 Model Detection and Information Display
void printESP32ModelInfo();
bool checkAuthentication();
void handleLogin();
void handleLogout();
void handleDisplayCurrent();
void handleDisplayImage();
void handleNextImage();
String getLoginPage();
void handleFirmwareUpdate();
void handleChangePassword();

// E-paper color definitions (4-bit values)
#define EPD_7IN3F_BLACK   0x0	/// 000
#define EPD_7IN3F_WHITE   0x1	///	001
#define EPD_7IN3F_GREEN   0x2	///	010
#define EPD_7IN3F_BLUE    0x3	///	011
#define EPD_7IN3F_RED     0x4	///	100
#define EPD_7IN3F_YELLOW  0x5	///	101
#define EPD_7IN3F_ORANGE  0x6	///	110
#define EPD_7IN3F_CLEAN   0x7	///	111   unavailable

/*Bitmap file header   14bit*/
typedef struct BMP_FILE_HEADER {
    uint16_t bType;        //File identifier
    uint32_t bSize;        //The size of the file
    uint16_t bReserved1;   //Reserved value, must be set to 0
    uint16_t bReserved2;   //Reserved value, must be set to 0
    uint32_t bOffset;      //The offset from the beginning of the file header to the beginning of the image data bit
} __attribute__ ((packed)) BMPFILEHEADER;    // 14bit

/*Bitmap information header  40bit*/
typedef struct BMP_INFO {
    uint32_t biInfoSize;      //The size of the header
    uint32_t biWidth;         //The width of the image
    uint32_t biHeight;        //The height of the image
    uint16_t biPlanes;        //The number of planes in the image
    uint16_t biBitCount;      //The number of bits per pixel
    uint32_t biCompression;   //Compression type
    uint32_t bimpImageSize;   //The size of the image, in bytes
    uint32_t biXPelsPerMeter; //Horizontal resolution
    uint32_t biYPelsPerMeter; //Vertical resolution
    uint32_t biClrUsed;       //The number of colors used
    uint32_t biClrImportant;  //The number of important colors
} __attribute__ ((packed)) BMPINFOHEADER;

// I2C Pin Configuration - PERFORMANCE OPTIMIZED
// Using ESP32 hardware I2C pins with maximum performance settings
int I2C_SDA_PIN = 21;   // ESP32 pin 21 connects to Renderer pin 4 (SDA)  
int I2C_SCL_PIN = 22;   // ESP32 pin 22 connects to Renderer pin 5 (SCL)
#define PI_PICO_I2C_ADDRESS 0x42  // Pi Pico I2C slave address

// PERFORMANCE OPTIMIZATION: Maximum I2C clock speed for ESP32
#define I2C_CLOCK_SPEED 5000000   // 5MHz - Maximum reliable speed for ESP32 Wire

WiFiManager wm;

// Web server for configuration UI
WebServer server(80);

// URL Management
#define MAX_URLS 10              // Maximum number of URLs to store
#define MAX_URL_LENGTH 512       // Maximum length per URL
Preferences preferences;         // For persistent URL storage
String imageUrls[MAX_URLS];      // Array to hold URLs
int urlCount = 0;                // Current number of URLs
int currentUrlIndex = 0;         // Index of current URL being used

// Global variables for web UI display
float current_battery_voltage = 0.0f;
uint32_t current_wakeup_interval = 30;
uint8_t current_charging_status = 3; // 0=not charging, 1=charging, 2=charge complete, 3=no external power
bool current_debug_mode = false; // Track debug mode status
uint32_t display_cycle_count = 0; // Track number of display updates for battery info
unsigned long last_status_update = 0;

// Flash wear leveling for URL storage
uint32_t write_cycle_counter = 0; // Track total write cycles for wear distribution

// PERFORMANCE-OPTIMIZED buffer sizes for maximum ESP32 efficiency and speed
// With 211KB free heap, we can use massive buffers for breakthrough performance!
static constexpr size_t BUFFER_SIZE = 65536; // 64KB - MASSIVE buffer for ESP32 (was 32KB)
static constexpr size_t STREAM_BUFFER_SIZE = 131072; // 128KB - ULTRA streaming efficiency (was 64KB) 
static constexpr size_t I2C_CHUNK_SIZE = 119; // Optimized I2C chunk size (128 - 9 byte header)
static constexpr size_t ULTRA_BURST_SIZE = 65536; // 64KB - MAXIMUM burst transfer size (was 32KB)

// Performance-optimized buffers - DMA-capable when available
static uint8_t* i2c_buffer = nullptr;
static uint8_t* stream_buffer = nullptr; 
static uint8_t* ultra_burst_buffer = nullptr;

// I2C performance tracking - ESP32 high-precision timing
static int64_t total_i2c_time_us = 0;  // Microsecond precision timing
static size_t total_bytes_transferred = 0;
uint32_t currentChunk = 0;  // Current chunk being sent
uint32_t totalChunks = (sizeof(Image7color) + I2C_CHUNK_SIZE - 1) / I2C_CHUNK_SIZE; // Total chunks needed

// I2C command definitions for master->slave communication
#define CMD_WRITE_CHUNK       0x01
#define CMD_WRITE_CHUNK_ADDR  0x04  // Write chunk to specific address offset
#define CMD_RENDER_IMAGE      0x02  
#define CMD_GET_STATUS        0x03
#define CMD_RENDER_BMP_ORDER  0x05  // Render image data that's in BMP order (needs reordering)
#define CMD_GET_BATTERY       0x06  // Get battery voltage
#define CMD_GET_WAKEUP        0x07  // Get RTC wakeup interval in minutes
#define CMD_SET_WAKEUP        0x08  // Set RTC wakeup interval in minutes
#define CMD_GET_CHARGING      0x09  // Get charging status (0=not charging, 1=charging, 2=charge complete)
#define CMD_SLEEP_NOW         0x0A  // Put renderer to sleep immediately
#define CMD_SET_BATTERY_INFO  0x0B  // Set battery info for overlay display (voltage, cycles)
#define CMD_GET_DEBUG_STATUS  0x0D  // Get debug mode status (0=off, 1=on)
#define CMD_SET_DEBUG_MODE    0x0E  // Set debug mode (0=off, 1=on)

// Status response codes from slave
#define STATUS_READY          0x00  // Ready for next image
#define STATUS_RECEIVING      0x01  // Receiving data
#define STATUS_READY_TO_RENDER 0x02 // Data received, ready to render
#define STATUS_ERROR          0x03  // Error occurred
#define STATUS_BATTERY_SET    0x86  // Battery info set successfully
#define STATUS_DEBUG_STATUS   0x88  // Debug status response follows
#define STATUS_DEBUG_SET      0x89  // Debug mode set successfully
#define STATUS_DEBUG_ERROR    0x8A  // Error setting debug mode

