FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
// Image download functionality
uint8_t* downloaded_image = nullptr;
size_t downloaded_size = 0;
bool download_success = false;

// Connection monitoring
unsigned long lastI2CActivity = 0;

// Authentication and security
String adminPassword = "photoframe2024";  // Default password
bool isAuthenticated = false;
unsigned long authTimeout = 0;
const unsigned long AUTH_TIMEOUT_MS = 900000; // 15 minutes session timeout
const String MASTER_RESET_PASSWORD = "FACTORY_RESET_ESP32_2024"; // Master recovery password
unsigned long i2cTransactionCount = 0;
unsigned long errorCount = 0;

// Convert RGB values to e-paper color index (from GUI_BMPfile.cpp algorithm)
uint8_t rgbToEpaperColor(uint8_t r, uint8_t g, uint8_t b) {
  // Correct Waveshare 7.3" F e-paper color mapping
  // Based on Waveshare documentation and actual color values
  
  if(r == 0 && g == 0 && b == 0){
    return EPD_7IN3F_BLACK;    // 0 - Black
  }else if(r == 255 && g == 255 && b == 255){
    return EPD_7IN3F_WHITE;    // 1 - White  
  }else if(r == 0 && g == 255 && b == 0){
    return EPD_7IN3F_GREEN;    // 2 - Green
  }else if(r == 0 && g == 0 && b == 255){
    return EPD_7IN3F_BLUE;     // 3 - Blue 
  }else if(r == 255 && g == 0 && b == 0){
    return EPD_7IN3F_RED;      // 4 - Red 
  }else if(r == 255 && g == 255 && b == 0){
    return EPD_7IN3F_YELLOW;   // 5 - Yellow 
  }else if(r == 255 && g == 165 && b == 0){
    return EPD_7IN3F_ORANGE;   // 6 - Orange 
  }
  
  // For non-exact matches, find closest color
  // This handles indexed BMPs with approximate colors
  uint32_t min_distance = UINT32_MAX;
  uint8_t best_color = EPD_7IN3F_WHITE;
  
  // Color distance calculation helper
  auto color_distance = [](uint8_t r1, uint8_t g1, uint8_t b1, uint8_t r2, uint8_t g2, uint8_t b2) -> uint32_t {
    int dr = r1 - r2, dg = g1 - g2, db = b1 - b2;
    return dr*dr + dg*dg + db*db;
  };
  
  // Check distance to each e-paper color
  struct { uint8_t r, g, b, color; } colors[] = {
    {0,   0,   0,   EPD_7IN3F_BLACK},
    {255, 255, 255, EPD_7IN3F_WHITE},
    {0,   255, 0,   EPD_7IN3F_GREEN},
    {0,   0,   255, EPD_7IN3F_BLUE},    // Keep standard blue
    {255, 0,   0,   EPD_7IN3F_RED},
    {255, 255, 0,   EPD_7IN3F_YELLOW},
    {255, 165, 0,   EPD_7IN3F_ORANGE}   // More standard orange (255,165,0)
  };
  
  for (auto& c : colors) {
    uint32_t distance = color_distance(r, g, b, c.r, c.g, c.b);
    if (distance < min_distance) {
      min_distance = distance;
      best_color = c.color;
    }
  }
  
  return best_color;
}

// Convert palette index to RGB using BMP palette
void paletteToRgb(uint8_t index, const uint8_t* palette, uint8_t* r, uint8_t* g, uint8_t* b) {
  // BMP palette format: B, G, R, reserved (4 bytes per color)
  uint32_t offset = index * 4;
  *b = palette[offset];
  *g = palette[offset + 1];
  *r = palette[offset + 2];
}

// Parse BMP header to extract dimensions and validate format
bool parseBmpHeader(const uint8_t* data, size_t len, BMPFILEHEADER* fileHeader, BMPINFOHEADER* infoHeader) {
  if (len < sizeof(BMPFILEHEADER) + sizeof(BMPINFOHEADER)) return false;
  
  // Copy file header
  memcpy(fileHeader, data, sizeof(BMPFILEHEADER));
  
  // Check BMP signature (should be "BM" = 0x4D42)
  if (fileHeader->bType != 0x4D42) return false;
  
  // Copy info header  
  memcpy(infoHeader, data + sizeof(BMPFILEHEADER), sizeof(BMPINFOHEADER));
  
  return true;
}

void checkI2CConnectionHealth() {
  unsigned long currentTime = millis();
  
  // Check if we haven't seen any I2C activity for a while
  if (lastI2CActivity > 0 && (currentTime - lastI2CActivity) > 30000) { // 30 seconds
    Serial.printf("WARNING: No I2C activity for %lu seconds\n", (currentTime - lastI2CActivity) / 1000);
    Serial.println("This could indicate:");
    Serial.println("  1. Slave device (Pi Pico) is not responding");
    Serial.println("  2. I2C wiring issues");
    Serial.println("  3. Address conflicts or timing issues");
    
    // Reset connection variables
    lastI2CActivity = currentTime;
  }
  
  // Print periodic status
  if (currentTime % 60000 == 0) { // Every minute
    Serial.printf("I2C Status: %lu transactions, %lu errors\n", 
                  i2cTransactionCount, errorCount);
  }
}

void printI2CConfiguration() {
  Serial.println("=== ESP32 I2C MASTER CONFIGURATION ===");
  Serial.printf("Pi Pico Slave Address: 0x%02X\n", PI_PICO_I2C_ADDRESS);
  Serial.printf("Pin Configuration:\n");
  Serial.printf("  SDA (Data)       : GPIO %d (connects to Renderer pin 4)\n", I2C_SDA_PIN);
  Serial.printf("  SCL (Clock)      : GPIO %d (connects to Renderer pin 5)\n", I2C_SCL_PIN);
  Serial.printf("Clock: 1.5MHz (Proven Optimal)\n");
  Serial.printf("Image size: %d bytes\n", sizeof(Image7color));
  Serial.printf("Total chunks: %d\n", totalChunks);
  Serial.println("=====================================");
  Serial.println("");
  Serial.println("🔌 WIRING CHECKLIST:");
  Serial.println("  ESP32 Pin 21 (SDA) → Pi Pico Pin 4 (GP2/SDA)");
  Serial.println("  ESP32 Pin 22 (SCL) → Pi Pico Pin 5 (GP3/SCL)");
  Serial.println("  ESP32 GND        → Pi Pico GND");
  Serial.println("  Both devices powered independently");
  Serial.println("");
  Serial.println("📋 TROUBLESHOOTING:");
  Serial.println("  1. Check Pi Pico has renderer.cpp uploaded");
  Serial.println("  2. Verify Pi Pico I2C address is 0x42");
  Serial.println("  3. Ensure no loose wire connections");
  Serial.println("  4. Try lower I2C speed if issues persist");
  Serial.println("=====================================");
}

// Send a chunk of data to Pi Pico slave with improved retry and optimized speed
bool sendImageChunk(uint32_t chunk_id, const uint8_t* data, size_t data_size) {
  // I2C buffer limit: 128 bytes buffer - 5 bytes header = 123 bytes max data
  if (data_size > 123) data_size = 123; // Max data size to fit in I2C transaction

  // Optimized retry loop - up to 3 attempts with minimal delays for speed
  for (int attempt = 0; attempt < 3; attempt++) {
    if (attempt > 0) {
      delay(2); // Minimal delay between retries for maximum speed (was 10ms)
    }
    
    Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
    Wire.write(CMD_WRITE_CHUNK);
    
