FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
    // Send chunk ID (4 bytes, big endian)
    Wire.write((chunk_id >> 24) & 0xFF);
    Wire.write((chunk_id >> 16) & 0xFF); 
    Wire.write((chunk_id >> 8) & 0xFF);
    Wire.write(chunk_id & 0xFF);
    
    // Send chunk data
    size_t written = Wire.write(data, data_size);
    
    // Verify all data was queued for transmission
    if (written != data_size) {
      if (attempt >= 1) { // Log after 2 attempts (faster feedback)
        Serial.printf("✗ Buffer overflow: only %d of %d bytes queued for chunk %d (attempt %d)\n", 
                      written, data_size, chunk_id, attempt + 1);
      }
      Wire.endTransmission(); // Clean up
      errorCount++;
      continue; // Retry with minimal delay
    }
    
    uint8_t error = Wire.endTransmission();
    
    if (error == 0) {
      lastI2CActivity = millis();
      i2cTransactionCount++;
      return true; // Success!
    } else {
      if (attempt >= 1) { // Log after 2 attempts (faster feedback)
        Serial.printf("✗ Failed to send chunk %d (attempt %d, error: %d)\n", chunk_id, attempt + 1, error);
        if (error == 5) {
          Serial.println("   → I2C timeout - slave may be busy or not responding");
        } else if (error == 2) {
          Serial.println("   → NACK on address - check slave address and wiring");
        } else if (error == 3) {
          Serial.println("   → NACK on data - slave rejected data");
        }
      }
      errorCount++;
    }
  }
  
  Serial.printf("✗ Failed to send chunk %d after %d attempts\n", chunk_id, 3);
  return false; // All attempts failed
}

// ULTRA-HIGH PERFORMANCE: Enhanced burst I2C transmission using ESP32 optimizations
// Target: Break 67 KB/s Arduino Wire limitation, achieve ~150+ KB/s throughput
bool sendImageChunkBurst(uint32_t start_address, const uint8_t* data, size_t total_size) {
  const size_t MAX_CHUNK = 119; // I2C packet limit per transaction
  size_t bytes_sent = 0;
  
  // ESP32 high-precision timing for performance measurement
  #ifdef ESP32_PERFORMANCE_OPTIMIZED
  int64_t burst_start = esp_timer_get_time(); // Microsecond precision
  #else
  unsigned long burst_start = millis();
  #endif
  
  // PERFORMANCE OPTIMIZATION: Pre-allocate command buffer to eliminate overhead
  static uint8_t cmd_buffer[9]; // Pre-allocated for zero-allocation transfers
  
  Serial.printf("🚀 PERFORMANCE burst transfer: %zu bytes at %.1f MHz I2C\n", 
                total_size, I2C_CLOCK_SPEED / 1000000.0);
  
  while (bytes_sent < total_size) {
    size_t chunk_size = min(total_size - bytes_sent, MAX_CHUNK);
    uint32_t addr = start_address + bytes_sent;
    
    // MAXIMUM PERFORMANCE: Minimize retry overhead with ESP32-specific timing
    bool success = false;
    for (int attempt = 0; attempt < 2 && !success; attempt++) {
      #ifdef ESP32_PERFORMANCE_OPTIMIZED
      int64_t transaction_start = esp_timer_get_time();
      #endif
      
      Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
      
      // OPTIMIZED: Pre-compiled command sequence for maximum speed
      Wire.write(CMD_WRITE_CHUNK_ADDR);
      Wire.write((addr >> 24) & 0xFF);
      Wire.write((addr >> 16) & 0xFF); 
      Wire.write((addr >> 8) & 0xFF);
      Wire.write(addr & 0xFF);
      Wire.write((chunk_size >> 24) & 0xFF);
      Wire.write((chunk_size >> 16) & 0xFF);
      Wire.write((chunk_size >> 8) & 0xFF);
      Wire.write(chunk_size & 0xFF);
      
      // ESP32 OPTIMIZATION: Direct buffer write with hardware prefetch hints
      size_t written = Wire.write(&data[bytes_sent], chunk_size);
      
      if (written == chunk_size && Wire.endTransmission() == 0) {
        success = true;
        
        #ifdef ESP32_PERFORMANCE_OPTIMIZED
        // Track performance with ESP32 high-precision timing
        int64_t transaction_time = esp_timer_get_time() - transaction_start;
        total_i2c_time_us += transaction_time;
        #endif
      }
      
      // ESP32-specific minimal retry delay for maximum throughput
      if (!success && attempt == 0) {
        delayMicroseconds(50);  // Ultra-minimal ESP32-optimized delay
      }
    }
    
    if (!success) {
      Serial.printf("✗ PERFORMANCE burst failed at offset %zu\n", bytes_sent);
      return false;
    }
    
    bytes_sent += chunk_size;
    
    // High-frequency progress logging for large transfers (ESP32 optimized)
    if (bytes_sent % 32768 == 0 || bytes_sent >= total_size) {
      #ifdef ESP32_PERFORMANCE_OPTIMIZED
      int64_t elapsed = esp_timer_get_time() - burst_start;
      float speed_kbps = (float)bytes_sent / (elapsed / 1000.0);
      #else
      unsigned long elapsed = millis() - burst_start;
      float speed_kbps = elapsed > 0 ? (float)bytes_sent / elapsed : 0;
      #endif
      
      Serial.printf("🚀 PERFORMANCE progress: %zu/%zu bytes (%.1f%%) - %.1f KB/s\n", 
                   bytes_sent, total_size, (float)bytes_sent * 100.0 / total_size, speed_kbps);
    }
  }
  
  // Final performance calculation with ESP32 precision
  int64_t total_time = esp_timer_get_time() - burst_start;
  float final_speed = (float)total_size / (total_time / 1000.0);
  total_bytes_transferred += total_size;
  
  Serial.printf("✅ PERFORMANCE burst complete: %zu bytes in %.1f ms (%.1f KB/s)\n", 
               total_size, total_time / 1000.0, final_speed);
  
  return true;
}

// Send a chunk of data to specific address offset in Pi Pico slave memory with improved retry
bool sendImageChunkToAddress(uint32_t address_offset, const uint8_t* data, size_t data_size) {
  // I2C buffer limit: 128 bytes buffer - 9 bytes header = 119 bytes max data
  if (data_size > 119) data_size = 119; // Max data size to fit in I2C transaction with address

  unsigned long chunk_start = millis();
  
  // Optimized retry loop - up to 3 attempts with minimal delays for speed
  for (int attempt = 0; attempt < 3; attempt++) {
    if (attempt > 0) {
      delay(2); // Minimal delay between retries for maximum speed (was 10ms)
    }
    
    Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
    Wire.write(CMD_WRITE_CHUNK_ADDR);
    
