FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
    // Check if this is a debug status response (0x88) or direct debug value
    if (status_or_debug == 0x88) {
      // This is a status response, need to read another byte
      delay(50);
      Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
      start = millis();
      while (Wire.available() < 1 && (millis() - start) < 200) {
        delay(5);
      }
      if (Wire.available() >= 1) {
        uint8_t debug_status = Wire.read();
        bool is_enabled = (debug_status != 0);
        Serial.printf("✓ Debug mode status: %s\n", is_enabled ? "ON" : "OFF");
        return is_enabled;
      }
    } else {
      // Direct response or old firmware - treat as debug status
      bool is_enabled = (status_or_debug != 0);
      Serial.printf("✓ Debug mode status (legacy): %s\n", is_enabled ? "ON" : "OFF");
      return is_enabled;
    }
  }
  
  Serial.println("✗ Failed to read debug mode status response (Pi Pico may need firmware update)");
  return false; // Default to false if no response
}

// Set debug mode on Pi Pico
bool setDebugMode(bool enable) {
  Serial.printf("Setting debug mode: %s\n", enable ? "ON" : "OFF");
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_SET_DEBUG_MODE);
  Wire.write(enable ? 1 : 0);
  uint8_t error = Wire.endTransmission();
  
  if (error == 0) {
    // Wait for response status
    delay(100);
    
    // Check status by reading response
    Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
    Wire.write(CMD_GET_STATUS);
    error = Wire.endTransmission();
    
    if (error == 0) {
      Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
      unsigned long start = millis();
      while (Wire.available() < 1 && (millis() - start) < 300) {
        delay(10);
      }
      
      if (Wire.available() >= 1) {
        uint8_t status = Wire.read();
        if (status == STATUS_DEBUG_SET) {
          Serial.printf("✓ Debug mode %s successfully\n", enable ? "enabled" : "disabled");
          return true;
        } else if (status == STATUS_DEBUG_ERROR) {
          Serial.printf("✗ Error setting debug mode\n");
          return false;
        } else {
          Serial.printf("✓ Debug mode command sent (status: 0x%02X, Pi Pico may not support debug commands yet)\n", status);
          return true; // Assume success for compatibility
        }
      }
    }
    
    Serial.printf("✓ Debug mode command sent (Pi Pico may not support debug commands yet)\n");
    return true; // Assume success if no clear error
  } else {
    Serial.printf("✗ Failed to send debug mode command, error: %d\n", error);
    return false;
  }
}

// Get RTC wakeup interval from Pi Pico (in minutes)
uint32_t getWakeupInterval() {
  Serial.println("Requesting wakeup interval from Pi Pico...");
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_GET_WAKEUP);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("Failed to send wakeup get command, error: %d\n", error);
    return 0;
  }
  
  delay(50); // Give Pi Pico time to prepare response
  
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 4);
  if (Wire.available() >= 4) {
    uint32_t interval;
    uint8_t* interval_bytes = (uint8_t*)&interval;
    for (int i = 0; i < 4; i++) {
      interval_bytes[i] = Wire.read();
    }
    Serial.printf("✓ Current wakeup interval: %lu minutes\n", interval);
    return interval;
  } else {
    Serial.printf("Failed to read wakeup interval response\n");
    return 0;
  }
}

// Set RTC wakeup interval on Pi Pico (in minutes)
bool setWakeupInterval(uint32_t minutes) {
  Serial.printf("Setting wakeup interval to %lu minutes...\n", minutes);
  
  if (minutes < 1 || minutes > 43800) {
    Serial.printf("Invalid wakeup interval: %lu (must be 1-43800 minutes)\n", minutes);
    return false;
  }
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_SET_WAKEUP);
  Wire.write((minutes >> 24) & 0xFF);
  Wire.write((minutes >> 16) & 0xFF);
  Wire.write((minutes >> 8) & 0xFF);
  Wire.write(minutes & 0xFF);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("Failed to send wakeup set command, error: %d\n", error);
    return false;
  }
  
  delay(100); // Give Pi Pico time to process
  
  // Check response
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
  if (Wire.available()) {
    uint8_t response = Wire.read();
    if (response == 0x82) {
      Serial.printf("✓ Wakeup interval successfully set to %lu minutes\n", minutes);
      return true;
    } else if (response == 0x83) {
      Serial.printf("Pi Pico rejected wakeup interval: %lu minutes\n", minutes);
      return false;
    } else {
      Serial.printf("Unexpected response from Pi Pico: 0x%02X\n", response);
      return false;
    }
  } else {
    Serial.printf("No response from Pi Pico for set wakeup command\n");
    return false;
  }
}

// Get charging status from Pi Pico (0=not charging, 1=charging, 2=charge complete, 3=no external power)
uint8_t getChargingStatus() {
  Serial.println("Requesting charging status from Pi Pico...");
  
  // Try multiple times in case Pi Pico is busy
  for (int attempt = 1; attempt <= 3; attempt++) {
    Serial.printf("Charging status attempt %d/3\n", attempt);
    
    Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
    Wire.write(CMD_GET_CHARGING);
    uint8_t error = Wire.endTransmission();
    
    if (error != 0) {
      Serial.printf("Failed to send charging status command, error: %d", error);
      if (error == 2) {
        Serial.println(" (NACK on address)");
      } else if (error == 5) {
        Serial.println(" (Timeout - Pi Pico busy)");
      } else {
        Serial.printf(" (Unknown error)\n");
      }
      
      if (attempt < 3) {
        delay(200);
        continue;
      }
      return 3; // Assume no external power on persistent failure
    }
    
    delay(100); // Give Pi Pico time to prepare response
    
    Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
    
    // Wait up to 300ms for response
    unsigned long start = millis();
    while (Wire.available() < 1 && (millis() - start) < 300) {
      delay(10);
    }
    
    if (Wire.available()) {
      uint8_t charging_status = Wire.read();
      const char* status_text[] = {"Not Charging", "Charging", "Charge Complete", "No External Power"};
      if (charging_status <= 3) {
        Serial.printf("✓ Charging status: %s (%d) (attempt %d)\n", 
                     status_text[charging_status], charging_status, attempt);
      } else {
        Serial.printf("✓ Charging status: Unknown (%d) (attempt %d)\n", 
                     charging_status, attempt);
      }
      return charging_status;
    } else {
      Serial.printf("Failed to read charging status response (attempt %d)\n", attempt);
      if (attempt < 3) {
        delay(200);
        continue;
      }
    }
  }
  
  Serial.println("✗ All charging status attempts failed");
  return 3; // Assume no external power on persistent failure
}

