FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
    if (old_count > 0) {
      Serial.println("Migrating from old storage format to wear-leveled storage...");
      active_namespace = "photoframe";
      write_cycle_counter = 1; // Start wear leveling
    }
  }
  
  // Load data from the active namespace
  preferences.begin(active_namespace.c_str(), false);
  urlCount = preferences.getInt("urlCount", 0);
  currentUrlIndex = preferences.getInt("currentIdx", 0);
  
  if (urlCount == 0) {
    // First time setup - add default URL
    Serial.println("No URLs found - adding default URL");
    imageUrls[0] = "https://raw.githubusercontent.com/FloThinksPi/PhotoPainter-ESP32/refs/heads/main/ImageConverter/Examples/arabella.bmp";
    urlCount = 1;
    currentUrlIndex = 0;
    preferences.end();
    saveUrls(); // This will use wear leveling
  } else {
    // Load existing URLs
    for (int i = 0; i < urlCount && i < MAX_URLS; i++) {
      String key = "url" + String(i);
      imageUrls[i] = preferences.getString(key.c_str(), "");
      Serial.printf("Loaded URL %d: %s\n", i, imageUrls[i].c_str());
    }
    preferences.end();
    
    // If we migrated from old format, save with wear leveling now
    if (!found_wear_leveled && urlCount > 0) {
      Serial.println("Converting to wear-leveled storage...");
      saveUrls();
    }
  }
  
  // Validate current index
  if (currentUrlIndex >= urlCount) {
    currentUrlIndex = 0;
  }
  
  // Load admin password with wear leveling support
  adminPassword = "photoframe2024"; // Default
  bool password_found = false;
  
  // Check wear-leveled admin namespaces (newest first)
  for (int cycle = (write_cycle_counter / 4); cycle >= 0 && cycle > (write_cycle_counter / 4) - 4; cycle--) {
    String admin_namespace = "admin" + String(cycle % 4);
    preferences.begin(admin_namespace.c_str(), true);
    String stored_password = preferences.getString("password", "");
    preferences.end();
    
    if (stored_password.length() > 0) {
      adminPassword = stored_password;
      password_found = true;
      Serial.printf("✓ Admin password loaded from wear-leveled namespace: %s\n", admin_namespace.c_str());
      break;
    }
  }
  
  // Fallback to old namespace if no wear-leveled password found
  if (!password_found) {
    preferences.begin("photoframe", true);
    String old_password = preferences.getString("password", "");
    preferences.end();
    
    if (old_password.length() > 0) {
      adminPassword = old_password;
      Serial.println("✓ Admin password loaded from legacy storage");
    }
  }
  
  Serial.printf("✓ URL storage initialized: %d URLs, current index: %d\n", urlCount, currentUrlIndex);
}

// Save URLs to persistent storage
void saveUrls() {
  // FLASH WEAR LEVELING: Distribute writes across different namespaces
  // This prevents wearing out the same flash sectors by rotating storage locations
  String namespace_base = "pf"; // Short namespace for efficiency
  String namespace_name = namespace_base + String(write_cycle_counter % 8); // Rotate across 8 namespaces
  
  write_cycle_counter++; // Increment for next write cycle
  
  Serial.printf("Using wear-leveled namespace: %s (cycle %d)\n", namespace_name.c_str(), write_cycle_counter);
  
  preferences.end(); // Close current namespace
  preferences.begin(namespace_name.c_str(), false); // Open rotated namespace
  
  preferences.putInt("urlCount", urlCount);
  preferences.putInt("currentIdx", currentUrlIndex);
  preferences.putInt("writeCycle", write_cycle_counter); // Store cycle counter for recovery
  
  for (int i = 0; i < urlCount; i++) {
    String key = "url" + String(i);
    preferences.putString(key.c_str(), imageUrls[i]);
  }
  
  preferences.end(); // Ensure data is flushed
  
  // Clean up old namespace data (optional - helps free flash space)
  if (write_cycle_counter > 8) {
    String old_namespace = namespace_base + String((write_cycle_counter - 8) % 8);
    Serial.printf("Cleaning old namespace: %s\n", old_namespace.c_str());
    preferences.begin(old_namespace.c_str(), false);
    preferences.clear(); // Clear old data
    preferences.end();
  }
  
  Serial.printf("✓ Saved %d URLs with wear leveling (cycle %d)\n", urlCount, write_cycle_counter);
}

// Save admin settings with wear leveling
void saveAdminSettings() {
  // FLASH WEAR LEVELING: Use separate namespace rotation for admin settings
  String admin_namespace = "admin" + String((write_cycle_counter / 4) % 4); // Rotate every 4 cycles
  
  Serial.printf("Saving admin settings to wear-leveled namespace: %s\n", admin_namespace.c_str());
  
  preferences.begin(admin_namespace.c_str(), false);
  preferences.putString("password", adminPassword);
  preferences.end();
  
  Serial.println("✓ Admin settings saved with wear leveling");
}

// Calculate battery percentage from voltage using Li-ion discharge curve
// Same algorithm as used in the display library for consistency
int calculateBatteryPercentage(float voltage) {
  if (voltage >= 4.0f) {
    return 100; // Everything above 4.0V is 100%
  } else if (voltage <= 3.3f) {
    return 0;   // Everything below 3.3V is 0%
  } else {
    // Non-linear interpolation matching Li-ion discharge curve
    // Using piecewise linear approximation of the curve
    if (voltage >= 3.8f) {
      // 4.0V-3.8V: 100% to 75% (steep drop at high voltage)
      return 75 + (int)((voltage - 3.8f) / (4.0f - 3.8f) * 25.0f);
    } else if (voltage >= 3.7f) {
      // 3.8V-3.7V: 75% to 50% (moderate slope)
      return 50 + (int)((voltage - 3.7f) / (3.8f - 3.7f) * 25.0f);
    } else if (voltage >= 3.6f) {
      // 3.7V-3.6V: 50% to 25% (moderate slope)
      return 25 + (int)((voltage - 3.6f) / (3.7f - 3.6f) * 25.0f);
    } else if (voltage >= 3.5f) {
      // 3.6V-3.5V: 25% to 10% (getting steeper)
      return 10 + (int)((voltage - 3.5f) / (3.6f - 3.5f) * 15.0f);
    } else if (voltage >= 3.4f) {
      // 3.5V-3.4V: 10% to 3% (steep drop)
      return 3 + (int)((voltage - 3.4f) / (3.5f - 3.4f) * 7.0f);
    } else {
      // 3.4V-3.3V: 3% to 0% (very steep drop near cutoff)
      return (int)((voltage - 3.3f) / (3.4f - 3.3f) * 3.0f);
    }
  }
}

