FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
  // Add visual battery percentage indicator
  if (battery_percentage >= 75) {
    percentage_indicator = "🔋"; // Full battery
  } else if (battery_percentage >= 50) {
    percentage_indicator = "🔋"; // Medium battery 
  } else if (battery_percentage >= 25) {
    percentage_indicator = "🪫"; // Low battery
  } else {
    percentage_indicator = "🪫"; // Critical battery
  }
  
  html += "<div class=\"i\">" + percentage_indicator + " Battery: <span class=\"" + battery_color + "\">" + 
          String(current_battery_voltage, 3) + "V (" + String(battery_percentage) + "%)</span> | " +
          "&#9889; Charging: " + String((current_charging_status == 0) ? "Not Charging" : 
          (current_charging_status == 1) ? "Charging" : (current_charging_status == 2) ? 
          "Charge Complete" : "No External Power") + "</div>";
  
  html += "<div class=\"i\">&#128472; Display Cycles: " + String(display_cycle_count) + " | " +
          "&#9200; Wakeup: " + String(current_wakeup_interval) + " min | " +
          "&#128295; Debug: " + String(current_debug_mode ? "ON" : "OFF") + " | " +
          "&#127760; IP: " + ipAddress + " | &#128193; URLs: " + String(urlCount) + 
          " (current: #" + String(currentUrlIndex + 1) + ")</div></div>";
  
  html += "<div class=\"control-section\"><h2>&#127918; Manual Controls</h2>";
  html += "<button class=\"display\" onclick=\"displayCurrent()\">&#128444; Display Current Image</button>";
  html += "<button class=\"next\" onclick=\"nextImage()\">&#9197; Next Image</button>";
  html += "<div id=\"control-status\"></div></div>";
  
  html += "<div class=\"f\"><h2>&#128279; Image URLs</h2>" + urlListHtml;
  html += "<div style=\"display:flex;gap:10px;margin-top:10px\">";
  html += "<input type=\"text\" id=\"url\" placeholder=\"https://example.com/image.jpg\" style=\"flex:1\">";
  html += "<button class=\"add\" onclick=\"addUrl()\" style=\"min-width:80px\">&#10133; Add</button></div></div>";
  
  html += "<div class=\"f\"><h2>&#9881; Configuration</h2>";
  html += "<input type=\"number\" id=\"wake\" min=\"1\" max=\"43800\" value=\"" + String(current_wakeup_interval) + "\" placeholder=\"Wakeup interval (1-43800 minutes)\">";
  html += "<button onclick=\"update()\">&#128190; Update</button><button onclick=\"refreshPage()\">&#128472; Refresh</button>";
  html += "<div style=\"margin-top:10px;display:flex;align-items:center;gap:10px\">";
  html += "<label for=\"debug-toggle\">Debug Mode:</label>";
  html += "<input type=\"checkbox\" id=\"debug-toggle\" " + String(current_debug_mode ? "checked" : "") + " onchange=\"updateDebugButton()\">";
  html += "<button id=\"debug-button\" onclick=\"toggleDebug()\">&#128295; " + String(current_debug_mode ? "Disable" : "Enable") + " Debug</button>";
  html += "</div></div>";
  
  html += "<div class=\"sec\"><h2>&#128274; Security</h2>";
  html += "<input type=\"password\" id=\"pwd\" placeholder=\"New Password (8+ characters)\">";
  html += "<button onclick=\"changePwd()\">&#128273; Change Password</button></div>";
  
  html += "<div class=\"up\"><h2>&#128193; Firmware Upload</h2>";
  html += "<input type=\"file\" id=\"fw\" accept=\".bin\"><button onclick=\"upload()\">&#11014; Upload Firmware</button><div id=\"upload-status\"></div></div>";
  
  html += "<div style=\"text-align:center;color:#666;margin-top:20px\">v2.4 | &#9201; " + String(millis() / 1000) + " sec | &#128190; " + String(ESP.getFreeHeap()) + " bytes free</div></div>";
  
  // Add JavaScript functions
  html += "<script>";
  html += "function logout(){fetch('/logout',{method:'POST'}).then(()=>location.reload())}";
  html += "function update(){const i=document.getElementById('wake').value;if(i>=1&&i<=43800)fetch('/setWakeup',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'minutes='+i}).then(r=>r.text()).then(d=>{showStatus(d,d.includes('success'));if(d.includes('success'))setTimeout(refreshPage,1500)});else showStatus('Please enter 1-43800 minutes',false)}";
  html += "function toggleDebug(){const checkbox=document.getElementById('debug-toggle');const button=document.getElementById('debug-button');const enabled=checkbox.checked;button.disabled=true;button.innerHTML='&#9203; Setting...';fetch('/setDebugMode',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'enable='+(enabled?'true':'false')}).then(r=>r.text()).then(d=>{showStatus(d,d.includes('success'));button.disabled=false;if(d.includes('success')){setTimeout(refreshPage,1500)}else{checkbox.checked=!enabled;updateDebugButton()}}).catch(e=>{showStatus('Failed to set debug mode',false);button.disabled=false;checkbox.checked=!enabled;updateDebugButton()})}";
  html += "function updateDebugButton(){const checkbox=document.getElementById('debug-toggle');const button=document.getElementById('debug-button');button.innerHTML='&#128295; '+(checkbox.checked?'Disable':'Enable')+' Debug'}";
  html += "function deleteUrl(i){if(confirm('Delete this URL?'))fetch('/deleteUrl',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'index='+i}).then(r=>r.text()).then(d=>{console.log('Delete response:',d);showStatus(d,d.includes('success'));if(d.includes('success'))setTimeout(refreshPage,1500)}).catch(e=>{console.error('Delete error:',e);showStatus('Failed to delete URL',false)})}";
  html += "function addUrl(){const u=document.getElementById('url').value;if(u)fetch('/addUrl',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'url='+encodeURIComponent(u)}).then(r=>r.text()).then(d=>{showStatus(d,d.includes('success'));if(d.includes('success')){document.getElementById('url').value='';setTimeout(refreshPage,1500)}});else showStatus('Please enter a URL',false)}";
  html += "function displayImage(i){document.getElementById('control-status').innerHTML='&#128444; Displaying image #'+(i+1)+'...';fetch('/displayImage',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'index='+i}).then(r=>r.text()).then(d=>{showControlStatus(d,d.includes('success'));if(d.includes('success'))setTimeout(refreshPage,2000)})}";
  html += "function displayCurrent(){document.getElementById('control-status').innerHTML='&#128444; Displaying current image...';fetch('/displayCurrent',{method:'POST'}).then(r=>r.text()).then(d=>{showControlStatus(d,d.includes('success'))})}";
  html += "function nextImage(){document.getElementById('control-status').innerHTML='&#9197; Loading next image...';fetch('/nextImage',{method:'POST'}).then(r=>r.text()).then(d=>{showControlStatus(d,d.includes('success'));if(d.includes('success'))setTimeout(refreshPage,2000)})}";
  html += "function changePwd(){const p=document.getElementById('pwd').value;if(p.length>=8)fetch('/changePassword',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'password='+encodeURIComponent(p)}).then(r=>r.text()).then(d=>{showStatus(d,d.includes('success'));document.getElementById('pwd').value=''});else showStatus('Password must be at least 8 characters',false)}";
  html += "function upload(){const f=document.getElementById('fw').files[0];if(!f||!f.name.endsWith('.bin')||f.size>2000000){showUploadStatus('Please select a valid .bin file under 2MB',false);return}if(!confirm('Upload firmware? Device will restart!'))return;const fd=new FormData();fd.append('firmware',f);showUploadStatus('&#128228; Uploading firmware...',true);fetch('/firmware',{method:'POST',body:fd}).then(r=>r.text()).then(d=>showUploadStatus(d,d.includes('success'))).catch(e=>showUploadStatus('X Upload failed',false))}";
  html += "function refreshPage(){location.reload()}";
  html += "function showStatus(msg,success){const div=document.createElement('div');div.className='status-msg '+(success?'status-success':'status-error');div.innerHTML=msg;document.body.appendChild(div);setTimeout(()=>div.remove(),4000)}";
  html += "function showControlStatus(msg,success){document.getElementById('control-status').innerHTML='<div class=\"status-msg '+(success?'status-success':'status-error')+'\">'+msg+'</div>';setTimeout(()=>document.getElementById('control-status').innerHTML='',4000)}";
  html += "function showUploadStatus(msg,isProgress){document.getElementById('upload-status').innerHTML='<div class=\"status-msg '+(isProgress?'status-success':'status-error')+'\">'+msg+'</div>'}";
  html += "</script></body></html>";
  
  // Debug: Check HTML length
  Serial.printf("✓ HTML generated successfully: %d bytes\n", html.length());
  
