FloThinksPi/PhotoPainter-ESP32/src/fetcher.cpp
  return html.c_str();
}

// Web server handlers
void handleRoot() {
  if (!checkAuthentication()) {
    server.send(200, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  // Update status from Pi Pico (with error handling)
  Serial.println("Updating status from Pi Pico...");
  
  float new_battery_voltage = getBatteryVoltage();
  if (new_battery_voltage > 0) {
    current_battery_voltage = new_battery_voltage;
  }
  
  uint32_t new_wakeup_interval = getWakeupInterval();
  if (new_wakeup_interval > 0) {
    current_wakeup_interval = new_wakeup_interval;
  }
  
  uint8_t new_charging_status = getChargingStatus();
  if (new_charging_status <= 3) { // Valid range 0-3
    current_charging_status = new_charging_status;
  }
  
  // Debug mode - safe to call even if Pi Pico doesn't support it yet
  bool new_debug_mode = getDebugMode();
  current_debug_mode = new_debug_mode;
  
  // Send battery info to display for overlay
  if (current_battery_voltage > 0.0f) {
    sendBatteryInfoToDisplay(current_battery_voltage, display_cycle_count);
  }
  
  last_status_update = millis();
  
  server.send(200, "text/html; charset=utf-8", getWebUI());
}

void handleSetWakeup() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("minutes")) {
    uint32_t minutes = server.arg("minutes").toInt();
    
    if (setWakeupInterval(minutes)) {
      current_wakeup_interval = minutes;
      server.send(200, "text/plain", "Wakeup interval updated successfully!");
    } else {
      server.send(400, "text/plain", "Failed to update wakeup interval");
    }
  } else {
    server.send(400, "text/plain", "Missing minutes parameter");
  }
}

void handleSetDebugMode() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("enable")) {
    bool enable = (server.arg("enable") == "true" || server.arg("enable") == "1");
    
    if (setDebugMode(enable)) {
      current_debug_mode = enable;
      server.send(200, "text/plain", String("Debug mode ") + (enable ? "enabled" : "disabled") + " successfully!");
    } else {
      server.send(400, "text/plain", "Failed to update debug mode");
    }
  } else {
    server.send(400, "text/plain", "Missing enable parameter");
  }
}

void handleAddUrl() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("url")) {
    String url = server.arg("url");
    
    if (addUrl(url)) {
      server.send(200, "text/plain", "URL added successfully!");
    } else {
      server.send(400, "text/plain", "Failed to add URL (duplicate, too long, or maximum reached)");
    }
  } else {
    server.send(400, "text/plain", "Missing URL parameter");
  }
}

void handleDeleteUrl() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("index")) {
    int index = server.arg("index").toInt();
    
    if (removeUrl(index)) {
      server.send(200, "text/plain", "URL deleted successfully!");
    } else {
      server.send(400, "text/plain", "Failed to delete URL (invalid index)");
    }
  } else {
    server.send(400, "text/plain", "Missing index parameter");
  }
}

void handleChangePassword() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("password")) {
    String newPassword = server.arg("password");
    
    if (newPassword.length() >= 8) {
      adminPassword = newPassword;
      saveAdminSettings(); // Use wear-leveled storage
      
      server.send(200, "text/plain", "Password changed successfully!");
      Serial.println("Admin password updated with wear leveling");
    } else {
      server.send(400, "text/plain", "Password must be at least 8 characters long");
    }
  } else {
    server.send(400, "text/plain", "Missing password parameter");
  }
}

void handleDisplayCurrent() {
  if (!checkAuthentication()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }
  
  last_status_update = millis();
  
  if (urlCount > 0) {
    Serial.println("🖼️ Manual display request - displaying current image");
    
    bool success = downloadAndConvertBmpImage(imageUrls[currentUrlIndex].c_str());
    
    if (success) {
      server.send(200, "text/plain", "✓ Displaying current image: " + imageUrls[currentUrlIndex]);
    } else {
      server.send(500, "text/plain", "❌ Failed to display image: " + imageUrls[currentUrlIndex]);
    }
  } else {
    server.send(400, "text/plain", "❌ No URLs configured");
  }
}

void handleDisplayImage() {
  if (!checkAuthentication()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }
  
  if (!server.hasArg("index")) {
    server.send(400, "text/plain", "❌ Missing index parameter");
    return;
  }
  
  int index = server.arg("index").toInt();
  
  if (index < 0 || index >= urlCount) {
    server.send(400, "text/plain", "❌ Invalid URL index: " + String(index));
    return;
  }
  
  last_status_update = millis();
  
  Serial.printf("🖼️ Manual display request - showing image %d/%d\n", index + 1, urlCount);
  
  bool success = downloadAndConvertBmpImage(imageUrls[index].c_str());
  
  if (success) {
    // Update current index to the displayed image with wear leveling
    currentUrlIndex = index;
    saveUrls(); // Use wear-leveled storage instead of direct write
    
    server.send(200, "text/plain", "✓ Displaying image " + String(index + 1) + "/" + String(urlCount) + ": " + imageUrls[index]);
  } else {
    server.send(500, "text/plain", "❌ Failed to display image " + String(index + 1) + ": " + imageUrls[index]);
  }
}

void handleNextImage() {
  if (!checkAuthentication()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }
  
  last_status_update = millis();
  
  if (urlCount > 0) {
    // Advance to next URL
    currentUrlIndex = (currentUrlIndex + 1) % urlCount;
    
    // Save current index with wear leveling
    saveUrls(); // Use wear-leveled storage instead of direct write
    
